## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_network_security_group.app_nsg will be created
  + resource "azurerm_network_security_group" "app_nsg" {
      + id                  = (known after apply)
      + location            = "canadacentral"
      + name                = "app-nsg"
      + resource_group_name = "akin0098-a12-rg"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "Allow-SSH"
              + priority                                   = 1001
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
        ]
      + tags                = {
          + "environment" = "production"
          + "project"     = "cst8918-lab12"
        }
    }

  # azurerm_subnet.app_subnet will be created
  + resource "azurerm_subnet" "app_subnet" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "app-subnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "akin0098-a12-rg"
      + virtual_network_name                           = "app-vnet"
    }

  # azurerm_subnet_network_security_group_association.app_subnet_nsg_assoc will be created
  + resource "azurerm_subnet_network_security_group_association" "app_subnet_nsg_assoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.app_vnet will be created
  + resource "azurerm_virtual_network" "app_vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "canadacentral"
      + name                = "app-vnet"
      + resource_group_name = "akin0098-a12-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "environment" = "production"
          + "project"     = "cst8918-lab12"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_subnet_id = (known after apply)
```
</details>